sslivins/bala2fire/sdkconfig.defaults
# M5Stack Fire / Bala2 Fire defaults
CONFIG_IDF_TARGET="esp32"

# 16 MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# 4 MB PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Higher CPU clock for balancing loop
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# C++ exceptions off (M5Unified uses RTTI but not exceptions)
CONFIG_COMPILER_CXX_RTTI=y

# 1 kHz FreeRTOS tick so the 200 Hz balancer loop has 5 ms resolution.
# (Default is 100 Hz, which rounds pdMS_TO_TICKS(5) to 0 ticks.)
CONFIG_FREERTOS_HZ=1000
